public class Main {
    public static void main(String[] args) {
        int amountBilet = 10000; // (20 рублей) стоимость билета
        int mili = 20;  // 1 миля за каждые потраченные 20 рублей
        int finish = amountBilet / mili;
        System.out.println("Вам будет начисленно миль : " + finish);




        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}